InformationRegisters/pcru_ex_РаспределениеСуммСпианияРасходовБудущихПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>pcru_ex_РаспределениеСуммСпианияРасходовБудущихПериодов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентТипЗатрат1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентТипЗатрат2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасходыБудущихПериодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗатрат1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОСубконто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗатрат2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОСубконто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/pcru_ex_РаспределениеСуммСпианияРасходовБудущихПериодов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.ПроцентТипЗатрат1 + Запись.ПроцентТипЗатрат2 <> 100 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Сумма по процентам распределения не равна 100";
		СообщениеПользователю.Сообщить();
		
		Отказ = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентТипЗатрат2ПриИзменении(Элемент)
	
	Запись.ПроцентТипЗатрат1 = 100 - Запись.ПроцентТипЗатрат2;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентТипЗатрат1ПриИзменении(Элемент)
	
	Запись.ПроцентТипЗатрат2 = 100 - Запись.ПроцентТипЗатрат1;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.ТипЗатрат1 = Справочники.БНФОСубконто.НайтиПоКоду("000000092");	//Тип затрат 1
		Запись.ТипЗатрат2 = Справочники.БНФОСубконто.НайтиПоКоду("000000093");	//Тип затрат 2
	КонецЕсли;
	
КонецПроцедуры
